<template>
<AppLayout>
    <Card>
        <template #content>
            <div class="ml-4 mr-4">
                <Toolbar>
                    <template #left>
                        <div class="mt-2 px-2"><Button label="หน่วยงานภายใน" icon="pi pi-home" class="p-button-info p-button-sm" /></div>
                        <div class="mt-2 px-2"><Button label="หน่วยงานภายนอก" icon="pi pi-globe" class="p-button-help p-button-sm" /></div>
                        <div class="mt-2 px-2"><Button label="บริษัทต่างๆ" icon="pi pi-briefcase" class="p-button-secondary p-button-sm" /></div>
                    </template>
                </Toolbar>
                <!-- หน่วยงานภายใน
                1	สาขาวิชาการบริบาลผู้ป่วยนอก		
                2	สาขาวิชาความดันโลหิตสูง		
                3	สาขาวิชาเคมีบำบัด		
                4	สาขาวิชาต่อมไร้ท่อและเมตะบอลิสม		
                5	สาขาวิชาโรคติดเชื้อและอายุรศาสตร์เขตร้อน		
                6	สาขาวิชาประสาทวิทยา		
                7	สาขาวิชาโภชนาการคลินิก		
                8	สาขาวิชาโรคข้อและรูมาติสซั่ม		
                9	สาขาวิชาโรคภูมิแพ้และภูมิคุ้มกัน		
                10	สาขาวิชาโรคระบบการหายใจและวัณโรค		
                11	สาขาวิชาโรคระบบทางเดินอาหาร		
                12	สาขาวิชาโลหิตวิทยา		
                13	สาขาวิชาวักกะวิทยา		
                14	สาขาวิชาเวชบำบัดวิกฤต		
                15	สาขาวิชาเวชพันธุศาสตร์		
                16	สาขาวิชาหทัยวิทยา		
                17	สาขาวิชาอายุรศาสตร์ปัจฉิมวัย		
                18	สาขาวิชาอายุรศาสตร์ทั่วไป		
                19	หน่วยการศึกษาก่อนปริญญา		
                20	หน่วยการศึกษาหลังปริญญา		
                21	หน่วยการเงิน		
                22	หน่วยศิลปวัฒนธรรม กีฬา และห้องประชุม		
                23	งานการลา และการจัดการความรู้		
                24	หน่วยเวชระเบียน		
                25	หน่วยพัฒนาคุณภาพ		
                26	หน่วยงบประมาณและพัสดุ		
                27	เลขานุการภาควิชาอายุรศาสตร์		
                28	งานทุนเฉลิมพระเกียรติ		
                29	งานบริหารจัดการเตียงสามัญ และ CME Credit		
                30	งานประชุมกรรมการบริหาร		
                31	งานใบปรึกษาผู้ป่วย		
                32	หน่วยเวชสารสนเทศและบริหารข้อมูล		
                33	งานโสตทัศนูปกรณ์		
                34	หน่วยวิจัยและวิชาการ		
                35	งานระบบนัดหมายผู้ป่วยนอก		
                36	งานสวัสดิการ		
                37	อาจารย์นอกภาควิชาฯ/อาจารย์พิเศษ		
                38	หน่วยนโยบายและแผน		
                39	หน่วยสอบทานทรัพยากรสุขภาพ		
                40	สำนักงานภาควิชาอายุรศาสตร์

                หน่วยงานภายนอก
                1	ภ.เวชศาสตร์ฉุกเฉิน		
                2	โครงการตำราศิริราช		
                3	การเจ้าหน้าที่คณะฯ		
                4	งานเวชภัณฑ์ คณะฯ		
                5	งานแพทยศาสตร์ศึกษาคณะฯ		
                6	งานโภชนศาสตร์		
                7	งานการเงิน		
                8	งานการพยาบาลศัลยศาสตร์และออร์โธฯ		
                9	งานการพยาบาลอายุรศาสตร์ฯ		
                10	งานคลังเวชภัณฑ์ยา		
                11	งานคลินิคพิเศษนอกเวลาราชการ		
                12	งานคุณธรรมจริยธรรม		
                13	งานจัดการความรู้ KM คณะฯ		
                14	งานตรวจสอบคุณภาพโรงพยาบาล		
                15	งานตรวจสอบภายในคณะฯ		
                16	งานธุรการและสนับสนุนฝ่ายวิศวกรรมบริการ		
                17	งานบริการและธุรการคณะฯ		
                18	งานบริการสุขภาพปฐมภูมิศิริราช		
                19	งานบริหารความเสี่ยงคณะฯ		
                20	งานบริหารบุคคลคณะฯ		
                21	งานบริหารทรัพยากรสุขภาพ		
                22	งานประเมินต้นทุน		
                23	งานประกันคุณภาพการศึกษาภายใน		
                24	งานประกันสุขภาพ		
                25	งานประชาสัมพันธ์ รพ.		
                26	งานประชุมวิชาการคณะฯ		
                27	งานพัฒนาคุณภาพคณะฯ		
                28	งานระบบแก๊สทางการแพทย์		
                29	งานวิเทศสัมพันธ์		
                30	งานวิจัย สำนักงานคณบดี		
                31	งานวิชาการคณะฯ		
                32	งานสร้างเสริมสุขภาพ		
                33	งานสังคมสงเคราะห์		
                34	งานสิทธิประกันสุขภาพ		
                35	งานสื่อสารคณะฯ		
                36	ตรวจสอบภายในคณะฯ		
                37	ฝ่ายเภสัชกรรม รพ.ศิริราช		
                38	ฝายการพยาบาลฯ		
                39	ฝ่ายทรัพยากรกายภาพและสิ่งแวดล้อม		
                40	ฝ่ายทรัพยากรทรัพยากรคณะฯ		
                41	ฝ่ายวิศวกรรม รพ.ศิริราช		
                42	ฝ่ายวิศวกรรมบริการและอาคารสถานที่		
                43	ฝ่ายสารสนเทศ		
                44	ภาควิชาเวชบำบัดวิกฤต		
                45	ภาควิชาเวชศาสตร์การธนาคารเลือด		
                46	ภาควิชาเวชศาสตร์ฉุกเฉิน		
                47	ภาควิชาเวชศาสตร์ป้องกันและสังคม		
                48	ภาควิชาเวชศาสตร์ป้องกันฯ		
                49	ภาควิชาเวชศาสตร์ฟื้นฟู		
                50	ภาควิชาโสต นาสิก ลาริงซ์วิทยา		
                51	ภาควิชากายวิภาคศาสตร์		
                52	ภาควิชากุมารเวชศาสตร์		
                53	ภาควิชาจักษุวิทยา		
                54	ภาควิชาจิตเวชศาสตร์		
                55	ภาควิชาตจวิทยา		
                56	ภาควิชานิติเวชศาสตร์		
                57	ภาควิชารังสีวิทยา		
                58	ภาควิชาวิทยาภูมิคุ้มกัน		
                59	ภาควิชาวิสัญญีวิทยา		
                60	ภาควิชาศัลยศาสตร์		
                61	ภาควิชาศัลยศาสตร์ออร์โธปิดิกส์และกายภาพบำบัด		
                62	ภาควิชาสูติศาสตร์-นรีเวชวิทยา		
                63	รพ.ศิริราชปิยมหาราชการุณย์		
                64	รองคณบดีฝ่ายบริหาร		
                65	วิชาการคณะฯ		
                66	ศูนย์เบาหวานศิริราช		
                67	ศูนย์แพ้ยา		
                68	ศูนย์คอมพิวเตอร์ รพ.ศิริราช		
                69	ศูนย์นิทรรักษ์ศิริราช ผะอบ 6		
                70	สโมสรนักศึกษาแพทย์ศิริราช		
                71	สมาคมโรคจากการหลับฯ		
                72	สมาคมอุรเวชช์		
                73	สารสนเทศคณะแพทยศาสตร์		
                74	สำนักงานคณบดี		
                75	สำนักงานผู้อำนวยการ		
                76	หน่วยการศึกษา ม.มหิดล ศาลายา กายภาพบำบัด		
                77	หน่วยงานประชุมคณะฯ		
                78	หน่วยตรวจสอบภายในและบริหารความเสี่ยง		
                79	หน่วยบริหารข้อมูล		
                80	หน่วยวินัยและนิติการ		
                81	หอผู้ป่วยอัษฎางค์ 11 เหนือ		
                82	ศูนย์ปลูกถ่ายไขกระดูก		
                83	หอผู้ป่วยอัษฎางค์ 12 ใต้		
                84	หอผู้ป่วยอัษฎางค์ 9 เหนือ		
                85	หอผู้ป่วย ICU 1		
                86	หอผู้ป่วย อ.ฎ. 6 ใต้		
                87	หอผู้ป่วยอัษฎางค์ 10 เหนือ		
                88	ภาควิชาจุลชีววิทยา		
                89	หอผู้ป่วยอัษฎางค์ 10 ใต้		
                90	งานบริการการศึกษา		
                91	หน่วยบริหารงานวิจัยเพื่อความเป็นเลิศ		
                92	หอผู้ป่วยอัษฎางค์ 12 เหนือ		
                93	หอผู้ป่วย 72/10 ตะวันตก		
                94	ศูนย์โรคหลอดเลือดสมอง		
                95	งานรักษาความปลอดภัย		
                96	ศูนย์บริรักษ์ศิริราช		
                97	ฝ่ายวิศวกรรมบริการและอาคารสถานที่		
                98	โครงการวิทยาการเวชศาสตร์ผู้สูงอายุระดับชาติ		
                99	งานเวชระเบียนคณะฯ		
                100	งานนโยบายและแผน		
                101	หน่วยวิจัยเพื่อขับเคลื่อนนโยบายสุขภาพ		
                102	โรงเรียนกายอุปกรณ์สิรินธร		
                103	รองคณบดีฝ่ายการศึกษาก่อนปริญญา		
                104	สารบรรณคณะฯ

                บริษัทต่างๆ
                1	บ.Bristol-Myers Squibb		
                2	บ.DKSH (Nexium)		
                3	บ.Novartis		
                4	บ.Novo Rapid		
                5	บ.UCB Trading (Thailand) LTD		
                6	บ.เกร๊ต อิสเทอร์น ดรั๊ก จำกัด		
                7	บ.เซอร์เวีย (ประเทศไทย) จำกัด		
                8	บ.เบอริงเกอร์ อินเกลไฮม์ (ไทย) จำกัด		
                9	บ.เมอร์ค จำกัด		
                10	บ.เอ็มเอสดี (ประเทศไทย) จำกัด		
                11	บ.แกล็กโซสมิทไคลน์ (ประเทศไทย) จำกัด (GSK)		
                12	บ.แอ๊บบอต ลาบอแรตอรีส จำกัด		
                13	บ.แอ๊บวี่ จำกัด		
                14	บ.แอลเลอร์แกน(ประเทศไทย) จำกัด		
                15	บ.แอสตร้าเซนเนก้า (ประเทศไทย)จำกัด		
                16	บ.โนโว นอร์ดิสด์ ฟาร์มา (ประเทศไทย) จำกัด		
                17	บ.โรช ไทยแลนด์ จำกัด		
                18	บ.ไทยโอซูก้า จำกัด		
                19	บ.ไฟเซอร์ (ประเทศไทย) จำกัด		
                20	บ.ซาโนฟี่-อเวนตีส (ประเทศไทย)จำกัด		
                21	บ.ดีเคเอสเอช (ประเทศไทย) จำกัด DKSH		
                22	บ.ทาเคดา (ประเทศไทย) จำกัด		
                23	บ.บริสตอล-ไมเยอร์ส สควิบบ์		
                24	บ.หาญไทย ฟาร์มา		
                25	บ.อีไล ลิลลี เอเซีย อิงค์ (สาขาประเทศไทย)		
                26	บ.อุยเฮง		
                27	บ.โรช ไดแอกโนสติกส์ (ประเทศไทย) จำกัด		
                28	บ.แกล็กโซสมิทไคล์น (ประเทศไทย)จำกัด		
                29	บ.เอ.เมนารินี (ประเทศไทย)จำกัด		
                30	บ. MSD จำกัด		
                31	บ.ไดอิจิ ซังเคียว (ประเทศไทย) จํากัด		
                32	บ.โอสถสภา ไทโช ฟาร์มาซูติคอล จำกัด		
                33	บ.ซิลลิค ฟาร์มา จำกัด		
                34	บริษัท โรช ไดแอกโนสติกส์ (ประเทศไทย) จํากัด		
                35	บริษัท อัพจอห์น(ประเทศไทย)จำกัด -->
            </div>
        </template>
    </Card>
    <Toast position="top-right" />
    <Toast position="center" group="errorkey" />
</AppLayout>
</template>

<script>
export default {
    
}
</script>